"""Константные сообщения"""


class MESSAGE_TEXT:

    """Раздел обработчика /start"""
    MESSAGE_ME = """Царь-Бог прибыл!!!
Чем займемся?"""
    MESSAGE_SANY = """Привет, <b>Сашка</b>
Кстати пошел нахер <3
можешь посчитать свои циферки"""
    MESSAGE_NEW_USER = """Привет, мы с тобой не знакомы
Как тебя зовут(имя, фамилия)?
И сколько тебе лет?"""

    """Раздел обработчика /help"""
    MESSAGE_NO_NAME = """У тебя нет имени?
Добавь его в Телеграм,
чтоб я знал как к тебе обращаться (:"""

    """Раздел обработчика Что умеешь?"""
    MESSAGE_SKILLS = """Так-так-так, что у нас тут"""

    """Обработчик сообщений"""
    MESSAGE_HELLO = ["Привет", "Здравствуй", "Hay", "Hello"]
    MESSAGE_NO_UNDERSTAND = """Не понял тебя"""

    """Раздел погоды"""
    MEESAGE_CITY_WEATHER = """В каком городе мне узнать погоду?"""
    MESSAGE_EXIT_WEATHER = """Для того чтоб закончить узнавать погоду напиши
* /stop *"""

    """Раздел калькулятора"""
    MESSAGE_NO_NUMBER = """"Что-то не так с числом :(
Введи его заново"""
    MESSAGE_NO_NUMBERS = """"Что-то не так с числами :(
Введи их заново"""
